Tekla Open API Reference for Tekla Structures 2025
ViewHandler.ZoomToBoundingBox Method (AABB)
Zooms the current model view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ZoomToBoundingBox(
	AABB box
)
Public Shared Function ZoomToBoundingBox (
	box As AABB
) As Boolean
Parameters
box
Type: Tekla.Structures.Geometry3d.AABB
The bounding box the current view is zoomed to.
Return Value
Type: Boolean
True on success.
Examples
 In the following example a part is picked and all the visible views are zoomed using the part's bounding box as a parameter.
using Tekla.Structures.Model;
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Picker MyPicker = new Picker();
           Part PickPart = MyPicker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART) as Part;
           AABB PartBoundingBox = new AABB();
           if (PickPart != null)
           {
               Solid PartSolid = PickPart.GetSolid();
               PartBoundingBox.MaxPoint = PartSolid.MaximumPoint;
               PartBoundingBox.MinPoint = PartSolid.MinimumPoint;
           }
           ModelViewEnumerator ViewEnum = ViewHandler.GetVisibleViews();
           while (ViewEnum.MoveNext())
           {
               View ViewSel = ViewEnum.Current;
               ViewHandler.ZoomToBoundingBox(ViewSel, PartBoundingBox);
           }
       }
}
See Also
Reference
ViewHandler Class
ZoomToBoundingBox Overload
Tekla.Structures.Model.UI Namespace